In [1]:
import sys
sys.path.append('d://the-recommender/DNN_for_YouTube_Recommendations')

from sample import ml1m_sample

sample_x, sample_y = ml1m_sample.Ml1mSample().ranking_sample()

# EAD sample_x
sample_x.head()

WARNING:tensorflow:From c:\Users\yuanshuai\AppData\Local\anaconda3\envs\tensorflow2\Lib\site-packages\keras\src\losses.py:2976: The name tf.losses.sparse_softmax_cross_entropy is deprecated. Please use tf.compat.v1.losses.sparse_softmax_cross_entropy instead.

,user_id,item_id,timestamp,title,genres,gender,age,occupation,zip,itemid_seq,itemid_seq_len
0,1,48,978824351,Pocahontas (1995),Animation|Children's|Musical|Romance,F,1,10,48067,48|1907|783|1|527,5
1,1,1907,978824330,Mulan (1998),Animation|Children's,F,1,10,48067,48|1907|783|1|527,5
2,1,783,978824291,"Hunchback of Notre Dame, The (1996)",Animation|Children's|Musical,F,1,10,48067,48|1907|783|1|527,5
3,1,1,978824268,Toy Story (1995),Animation|Children's|Comedy,F,1,10,48067,48|1907|783|1|527,5
4,1,527,978824195,Schindler's List (1993),Drama|War,F,1,10,48067,48|1907|783|1|527,5

In [2]:
sample_x.shape

(471163, 11)

In [3]:
sample_x.describe()

,user_id,item_id,timestamp,age,occupation,itemid_seq_len
count,471163.000000,471163.000000,4.711630e+05,471163.000000,471163.000000,471163.000000
mean,3036.993406,1921.365659,9.733769e+08,29.147783,7.996683,4.999435
std,1742.711571,1128.317700,1.390631e+07,11.763094,6.429484,0.031713
min,1.000000,1.000000,9.567039e+08,1.000000,0.000000,1.000000
25%,1500.000000,1035.000000,9.653094e+08,25.000000,2.000000,5.000000
50%,3081.000000,1939.000000,9.733748e+08,25.000000,7.000000,5.000000
75%,4522.000000,2906.000000,9.755711e+08,35.000000,14.000000,5.000000
max,6040.000000,3952.000000,1.046455e+09,56.000000,20.000000,5.000000

In [4]:
sample_x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 471163 entries, 0 to 471162
Data columns (total 11 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   user_id         471163 non-null  int64
 1   item_id         471163 non-null  int64
 2   timestamp       471163 non-null  int64
 3   title           471163 non-null  object
 4   genres          471163 non-null  object
 5   gender          471163 non-null  object
 6   age             471163 non-null  int64
 7   occupation      471163 non-null  int64
 8   zip             471163 non-null  object
 9   itemid_seq      471163 non-null  object
 10  itemid_seq_len  471163 non-null  int64
dtypes: int64(6), object(5)
memory usage: 39.5+ MB

In [5]:
#EDA sample_y 

sample_y.head()

   rating
0       5
1       4
2       4
3       5
4       5

In [6]:
sample_y.shape

(471163, 1)

In [7]:
sample_y.describe()

              rating
count  471163.000000
mean        3.551960
std         1.117825
min         1.000000
25%         3.000000
50%         4.000000
75%         4.000000
max         5.000000

In [8]:
sample_y.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 471163 entries, 0 to 471162
Data columns (total 1 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   rating  471163 non-null  int64
dtypes: int64(1)
memory usage: 3.6 MB